In [1]:
import pandas as pd

In [4]:
s=pd.Series([1,2,3,4,5])

In [5]:
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
s.name = 'number'

In [7]:
print(s)

0    1
1    2
2    3
3    4
4    5
Name: number, dtype: int64

In [8]:
fruits = {
    'mango':20,
    'apple':10,
    'orange':200,
    'pine apple':30
}

In [9]:
s = pd.Series(fruits , name='proteins')

In [10]:
print(s)

mango          20
apple          10
orange        200
pine apple     30
Name: proteins, dtype: int64

In [11]:
s['orange'] = 10

In [12]:
print(s)

mango         20
apple         10
orange        10
pine apple    30
Name: proteins, dtype: int64

In [ ]:
print(s.index)

Index(['mango', 'apple', 'orange', 'pine apple'], dtype='object')

In [6]:
# Dataframe
values = {
    'Names':["Dhiraj",'Dinesh','Monisha','Umadevi','Manavalan'],
    'Age':[23,23,29,47,52],
    'Gender':['Male','Male','Female','Female','Male']
}

In [7]:
data=pd.DataFrame(values)

In [8]:
print(data)

       Names  Age  Gender
0     Dhiraj   23    Male
1     Dinesh   23    Male
2    Monisha   29  Female
3    Umadevi   47  Female
4  Manavalan   52    Male

In [9]:
index = ['Me','Twin Brother','Elder Sister','Mother','Father']

In [10]:
data.index = index

In [11]:
print(data)

                  Names  Age  Gender
Me               Dhiraj   23    Male
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [12]:
print(data.head(2))

               Names  Age Gender
Me            Dhiraj   23   Male
Twin Brother  Dinesh   23   Male

In [13]:
print(data.tail())

                  Names  Age  Gender
Me               Dhiraj   23    Male
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [14]:
print(data.tail(2))

            Names  Age  Gender
Mother    Umadevi   47  Female
Father  Manavalan   52    Male

In [17]:
print(data.iloc[1:3])

                Names  Age  Gender
Twin Brother   Dinesh   23    Male
Elder Sister  Monisha   29  Female

In [18]:
print(data.iloc[1:3])

                Names  Age  Gender
Twin Brother   Dinesh   23    Male
Elder Sister  Monisha   29  Female

In [28]:
print(data.loc['Me':, ["Age"]])

              Age
Me             23
Twin Brother   23
Elder Sister   29
Mother         47
Father         52

In [32]:
print(data.loc['Twin Brother':, ['Age']])

              Age
Twin Brother   23
Elder Sister   29
Mother         47
Father         52

In [37]:
data.iloc[1:3, 1:3]

              Age  Gender
Twin Brother   23    Male
Elder Sister   29  Female

In [38]:
data["Age"]

Me              23
Twin Brother    23
Elder Sister    29
Mother          47
Father          52
Name: Age, dtype: int64

In [39]:
data[["Gender","Age"]]

              Gender  Age
Me              Male   23
Twin Brother    Male   23
Elder Sister  Female   29
Mother        Female   47
Father          Male   52

In [40]:
data.drop("Age",axis=1)

                  Names  Gender
Me               Dhiraj    Male
Twin Brother     Dinesh    Male
Elder Sister    Monisha  Female
Mother          Umadevi  Female
Father        Manavalan    Male

In [45]:
data.drop("Me",axis=0)

                  Names  Age  Gender
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [46]:
data

                  Names  Age  Gender
Me               Dhiraj   23    Male
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [47]:
data.shape

(5, 3)

In [49]:
print(data.shape)

(5, 3)

In [50]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Me to Father
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   5 non-null      object
 1   Age     5 non-null      int64
 2   Gender  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 332.0+ bytes

In [51]:
data.describe()

             Age
count   5.000000
mean   34.800000
std    13.754999
min    23.000000
25%    23.000000
50%    29.000000
75%    47.000000
max    52.000000

In [52]:
data

                  Names  Age  Gender
Me               Dhiraj   23    Male
Twin Brother     Dinesh   23    Male
Elder Sister    Monisha   29  Female
Mother          Umadevi   47  Female
Father        Manavalan   52    Male

In [61]:

values = {
    'Names':["Dhiraj",'Dinesh','Monisha','Umadevi','Manavalan'],
    'Age':[23,23,29,47,52],
    'Gender':['Male','Male','Female','Female','Male'],
    'Salary':[2000,3000,4000,5000,6000]

}

In [62]:
data = pd.DataFrame(values)

In [63]:
data

       Names  Age  Gender  Salary
0     Dhiraj   23    Male    2000
1     Dinesh   23    Male    3000
2    Monisha   29  Female    4000
3    Umadevi   47  Female    5000
4  Manavalan   52    Male    6000

In [67]:
data.iloc[1:3, :2]

     Names  Age
1   Dinesh   23
2  Monisha   29

In [ ]:
# Broadcasting
data["Salary"] = data["Salary"]+5000

In [69]:
data

       Names  Age  Gender  Salary
0     Dhiraj   23    Male    7000
1     Dinesh   23    Male    8000
2    Monisha   29  Female    9000
3    Umadevi   47  Female   10000
4  Manavalan   52    Male   11000

In [70]:
# Rename a column
data.rename(columns={'Age':'Ages'})

       Names  Ages  Gender  Salary
0     Dhiraj    23    Male    7000
1     Dinesh    23    Male    8000
2    Monisha    29  Female    9000
3    Umadevi    47  Female   10000
4  Manavalan    52    Male   11000

In [71]:
data

       Names  Age  Gender  Salary
0     Dhiraj   23    Male    7000
1     Dinesh   23    Male    8000
2    Monisha   29  Female    9000
3    Umadevi   47  Female   10000
4  Manavalan   52    Male   11000

In [72]:
data.rename(columns={'Age':'Ages'},inplace=True)

In [73]:
data

       Names  Ages  Gender  Salary
0     Dhiraj    23    Male    7000
1     Dinesh    23    Male    8000
2    Monisha    29  Female    9000
3    Umadevi    47  Female   10000
4  Manavalan    52    Male   11000

In [74]:
data["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [82]:
data["Gender"].value_counts()

Gender
Male      3
Female    2
Name: count, dtype: int64

In [76]:
data["Promoted Salary"] = data["Salary"]+2000

In [77]:
data

       Names  Ages  Gender  Salary  Promoted Salary
0     Dhiraj    23    Male    7000             9000
1     Dinesh    23    Male    8000            10000
2    Monisha    29  Female    9000            11000
3    Umadevi    47  Female   10000            12000
4  Manavalan    52    Male   11000            13000

In [83]:
data

       Names  Ages  Gender  Salary  Promoted Salary
0     Dhiraj    23    Male    7000             9000
1     Dinesh    23    Male    8000            10000
2    Monisha    29  Female    9000            11000
3    Umadevi    47  Female   10000            12000
4  Manavalan    52    Male   11000            13000

In [84]:
data['Work'] = ['Working','Studying','Lecturer','Teacher',"Civil Engineer"]

In [85]:
data

       Names  Ages  Gender  Salary  Promoted Salary            Work
0     Dhiraj    23    Male    7000             9000         Working
1     Dinesh    23    Male    8000            10000        Studying
2    Monisha    29  Female    9000            11000        Lecturer
3    Umadevi    47  Female   10000            12000         Teacher
4  Manavalan    52    Male   11000            13000  Civil Engineer

In [86]:
data['Dhiraj'] = None

In [87]:
data

       Names  Ages  Gender  Salary  Promoted Salary            Work Dhiraj
0     Dhiraj    23    Male    7000             9000         Working   None
1     Dinesh    23    Male    8000            10000        Studying   None
2    Monisha    29  Female    9000            11000        Lecturer   None
3    Umadevi    47  Female   10000            12000         Teacher   None
4  Manavalan    52    Male   11000            13000  Civil Engineer   None

In [91]:
data.loc[data['Names']=='Dhiraj','Salary']=None

In [92]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work Dhiraj
0     Dhiraj    23    Male      NaN             9000         Working   None
1     Dinesh    23    Male   8000.0            10000        Studying   None
2    Monisha    29  Female   9000.0            11000        Lecturer   None
3    Umadevi    47  Female  10000.0            12000         Teacher   None
4  Manavalan    52    Male  11000.0            13000  Civil Engineer   None

In [93]:
data['Promoted Salary'] = data['Salary']+2000

In [94]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work Dhiraj
0     Dhiraj    23    Male      NaN              NaN         Working   None
1     Dinesh    23    Male   8000.0          10000.0        Studying   None
2    Monisha    29  Female   9000.0          11000.0        Lecturer   None
3    Umadevi    47  Female  10000.0          12000.0         Teacher   None
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer   None

In [95]:
# Data Cleaning
data.isnull()

   Names   Ages  Gender  Salary  Promoted Salary   Work  Dhiraj
0  False  False   False    True             True  False    True
1  False  False   False   False            False  False    True
2  False  False   False   False            False  False    True
3  False  False   False   False            False  False    True
4  False  False   False   False            False  False    True

In [96]:
data.isnull().sum()

Names              0
Ages               0
Gender             0
Salary             1
Promoted Salary    1
Work               0
Dhiraj             5
dtype: int64

In [103]:
print(data.dropna(how='all'))

       Names  Ages  Gender   Salary  Promoted Salary            Work Dhiraj
0     Dhiraj    23    Male      NaN              NaN         Working   None
1     Dinesh    23    Male   8000.0          10000.0        Studying   None
2    Monisha    29  Female   9000.0          11000.0        Lecturer   None
3    Umadevi    47  Female  10000.0          12000.0         Teacher   None
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer   None

In [99]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work Dhiraj
0     Dhiraj    23    Male      NaN              NaN         Working   None
1     Dinesh    23    Male   8000.0          10000.0        Studying   None
2    Monisha    29  Female   9000.0          11000.0        Lecturer   None
3    Umadevi    47  Female  10000.0          12000.0         Teacher   None
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer   None

In [104]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work Dhiraj
0     Dhiraj    23    Male      NaN              NaN         Working   None
1     Dinesh    23    Male   8000.0          10000.0        Studying   None
2    Monisha    29  Female   9000.0          11000.0        Lecturer   None
3    Umadevi    47  Female  10000.0          12000.0         Teacher   None
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer   None

In [106]:
data.drop('Dhiraj',axis=1)

       Names  Ages  Gender   Salary  Promoted Salary            Work
0     Dhiraj    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [107]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work Dhiraj
0     Dhiraj    23    Male      NaN              NaN         Working   None
1     Dinesh    23    Male   8000.0          10000.0        Studying   None
2    Monisha    29  Female   9000.0          11000.0        Lecturer   None
3    Umadevi    47  Female  10000.0          12000.0         Teacher   None
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer   None

In [108]:
data.drop('Dhiraj',axis=1,inplace=True)

In [109]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0     Dhiraj    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [110]:
data.isnull()

   Names   Ages  Gender  Salary  Promoted Salary   Work
0  False  False   False    True             True  False
1  False  False   False   False            False  False
2  False  False   False   False            False  False
3  False  False   False   False            False  False
4  False  False   False   False            False  False

In [111]:
data.isnull().sum()

Names              0
Ages               0
Gender             0
Salary             1
Promoted Salary    1
Work               0
dtype: int64

In [112]:
data['Salary'].fillna(data['Salary'].mean())

0     9500.0
1     8000.0
2     9000.0
3    10000.0
4    11000.0
Name: Salary, dtype: float64

In [113]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0     Dhiraj    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [114]:
data['Salary'].fillna(method='ffill')

C:\Users\dhira\AppData\Local\Temp\ipykernel_11076\755933689.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data['Salary'].fillna(method='ffill')

0        NaN
1     8000.0
2     9000.0
3    10000.0
4    11000.0
Name: Salary, dtype: float64

In [115]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0     Dhiraj    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [117]:
data['Salary'].fillna(method = 'bfill')

C:\Users\dhira\AppData\Local\Temp\ipykernel_11076\327954280.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data['Salary'].fillna(method = 'bfill')

0     8000.0
1     8000.0
2     9000.0
3    10000.0
4    11000.0
Name: Salary, dtype: float64

In [118]:
data['Names'].replace('Dhiraj','Dhi')

0          Dhi
1       Dinesh
2      Monisha
3      Umadevi
4    Manavalan
Name: Names, dtype: object

In [119]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0     Dhiraj    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [125]:
data['Names'] = data['Names'].replace('Dhiraj','Dhiru')

In [126]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0      DHiru    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [127]:
data['Names'] = data['Names'].replace('Dhiraj','Dhiru')

In [128]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0      DHiru    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [129]:
data['Names'] = data['Names'].replace('DHiru','Dhiru')

In [130]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0      Dhiru    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [131]:
data[data.duplicated()]

Empty DataFrame
Columns: [Names, Ages, Gender, Salary, Promoted Salary, Work]
Index: []

In [132]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0      Dhiru    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer

In [133]:
data = pd.concat([
    data,
    pd.DataFrame([{
        "Names": "Dinesh",
        "Ages": 23,
        "Gender": "Male",
        "Salary": 8000,
        "Promoted Salary": 10000,
        "Work": "Studying"
    }])
], ignore_index=True)

In [134]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0      Dhiru    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer
5     Dinesh    23    Male   8000.0          10000.0        Studying

In [135]:
data[data.duplicated()]

    Names  Ages Gender  Salary  Promoted Salary      Work
5  Dinesh    23   Male  8000.0          10000.0  Studying

In [136]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0      Dhiru    23    Male      NaN              NaN         Working
1     Dinesh    23    Male   8000.0          10000.0        Studying
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer
5     Dinesh    23    Male   8000.0          10000.0        Studying

In [137]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [138]:
data[data.duplicated()]

    Names  Ages Gender  Salary  Promoted Salary      Work
5  Dinesh    23   Male  8000.0          10000.0  Studying

In [139]:
data[data.duplicated(keep='first')]

    Names  Ages Gender  Salary  Promoted Salary      Work
5  Dinesh    23   Male  8000.0          10000.0  Studying

In [140]:
data[data.duplicated(keep='last')]

    Names  Ages Gender  Salary  Promoted Salary      Work
1  Dinesh    23   Male  8000.0          10000.0  Studying

In [141]:
data=data.drop_duplicates(keep='last')

In [142]:
data

       Names  Ages  Gender   Salary  Promoted Salary            Work
0      Dhiru    23    Male      NaN              NaN         Working
2    Monisha    29  Female   9000.0          11000.0        Lecturer
3    Umadevi    47  Female  10000.0          12000.0         Teacher
4  Manavalan    52    Male  11000.0          13000.0  Civil Engineer
5     Dinesh    23    Male   8000.0          10000.0        Studying

In [148]:
data = pd.read_csv("C:/Users/dhira/Downloads/Maven+Fuzzy+Factory\order_items.csv")

<>:1: SyntaxWarning: invalid escape sequence '\o'
<>:1: SyntaxWarning: invalid escape sequence '\o'
C:\Users\dhira\AppData\Local\Temp\ipykernel_11076\1939399627.py:1: SyntaxWarning: invalid escape sequence '\o'
  data = pd.read_csv("C:/Users/dhira/Downloads/Maven+Fuzzy+Factory\order_items.csv")

In [149]:
data.head()

,order_item_id,created_at,order_id,product_id,is_primary_item,price_usd,cogs_usd
0,1,2012-03-19 10:42:46,1,1,1,49.99,19.49
1,2,2012-03-19 19:27:37,2,1,1,49.99,19.49
2,3,2012-03-20 06:44:45,3,1,1,49.99,19.49
3,4,2012-03-20 09:41:45,4,1,1,49.99,19.49
4,5,2012-03-20 11:28:15,5,1,1,49.99,19.49

In [150]:
data.head(7)

,order_item_id,created_at,order_id,product_id,is_primary_item,price_usd,cogs_usd
0,1,2012-03-19 10:42:46,1,1,1,49.99,19.49
1,2,2012-03-19 19:27:37,2,1,1,49.99,19.49
2,3,2012-03-20 06:44:45,3,1,1,49.99,19.49
3,4,2012-03-20 09:41:45,4,1,1,49.99,19.49
4,5,2012-03-20 11:28:15,5,1,1,49.99,19.49
5,6,2012-03-20 16:12:47,6,1,1,49.99,19.49
6,7,2012-03-20 17:03:41,7,1,1,49.99,19.49

In [152]:
data.shape

(40025, 7)

In [153]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40025 entries, 0 to 40024
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_item_id    40025 non-null  int64
 1   created_at       40025 non-null  object
 2   order_id         40025 non-null  int64
 3   product_id       40025 non-null  int64
 4   is_primary_item  40025 non-null  int64
 5   price_usd        40025 non-null  float64
 6   cogs_usd         40025 non-null  float64
dtypes: float64(2), int64(4), object(1)
memory usage: 2.1+ MB